АлогистикТест2/src/Documents/алк_ПеремещениеПорт/алк_ПеремещениеПорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеПорт</name>
  <basedOn>Document.алк_ТранспортировочныеПартии</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаВнешнихСкладахСерии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ПеремещениеПорт/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Распределить(Команда) 
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Сообщить("Заполните организацию!"); 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда 		
		Сообщить("Заполните склад!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда 		
		Сообщить("Заполните дату!");
		Возврат;
	КонецЕсли; 
	
	РаспределитьНаСервере();
КонецПроцедуры   

&НаСервере
Процедура РаспределитьНаСервере()  
	
	Если Объект.Запасы.Количество() = 0 Тогда
		
		Сообщить("Заполните в табличной части строку с Номеклатурой и Количеством для распределения!");
		Возврат;
		
	Иначе
		
		Номенклатура 		= Объект.Запасы[0].Номенклатура;		
		КоличествоКСписанию = Объект.Запасы[0].Количество;		
		СтруктурнаяЕдиница 	= Объект.СтруктурнаяЕдиница;
		Организация 		= Объект.Организация; 
		ДатаОстатков 		= Объект.Дата;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&ДатаОстатков,
		|			Номенклатура = &Номенклатура
		|				И Организация = &Организация) КАК алк_ОстаткиЗапасовОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_ОстаткиЗапасовОстатки.Характеристика.Код";
		
		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если РезультатЗапроса.Пустой() Тогда 
			
			Сообщить("Нет остатков к распределению!");
			Возврат;
		
		КонецЕсли; 
		
		Объект.Запасы.Очистить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
			
			ОстатокПоХарактеристике = ВыборкаДетальныеЗаписи.КоличествоОстаток;  
			
			Если ОстатокПоХарактеристике <= 0 Тогда
				Продолжить;		
			КонецЕсли;
			
			Списание = Мин(ОстатокПоХарактеристике, КоличествоКСписанию);
			
			КоличествоКСписанию = КоличествоКСписанию - Списание; 
			
			НоваяСтр = Объект.Запасы.Добавить();
			НоваяСтр.Номенклатура 	= Номенклатура;
			НоваяСтр.Характеристика	= ВыборкаДетальныеЗаписи.Характеристика;
			НоваяСтр.Количество	 	= Списание; 
			
			Если КоличествоКСписанию = 0 Тогда				
				Прервать;		
			КонецЕсли;		
			
		КонецЦикла;
		
		Если Не КоличествоКСписанию = 0 Тогда
			
			НоваяСтр = Объект.Запасы.Добавить();
			НоваяСтр.Номенклатура 	= Номенклатура;			
			НоваяСтр.Количество		= КоличествоКСписанию; 
			
			Сообщить("Не хватило остатков для списания: "  + КоличествоКСписанию); 
			
		КонецЕсли;	
		
	КонецЕсли; 
	
КонецПроцедуры
